---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SiteCannotDrawSurfaceBoundary
source: html/486fbd9f-03ef-88a3-87d3-684ebb244dd4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SiteCannotDrawSurfaceBoundary Property

Cannot make surface with specified boundary.

## Syntax (C#)
```csharp
public static FailureDefinitionId SiteCannotDrawSurfaceBoundary { get; }
```